app/controllers/pages_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC
---
  def home

    @newPost = Post.new
    @posts = Post.all

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "hello"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
SELECT "posts".* FROM "posts" WHERE (user_id=2)  ORDER BY "posts"."created_at" DESC
---
  def profile
    #grab the username from the URL and set it as :id
    if (User.find_by_username(params[:id]))
      @username = params[:id]
    else
      #redirects to 404 / root for now
      redirect_to root_path, :notice => "User Not Found!"

    end

    @posts = Post.all.where("user_id=?", (User.find_by_username(params[:id])))